logs/fio-diskrnd/hpk/000/log007.txt
+ kubectl create namespace bench
namespace/bench created
+ kubectl create -n bench -f -
persistentvolumeclaim/claim1 created
+ kubectl create -n bench -f -
pod/fio created
+ kubectl wait -n bench --for condition=Ready --timeout=10m pod/fio
pod/fio condition met
+ kubectl wait -n bench --for condition=Ready=False --timeout=10h pod/fio
pod/fio condition met
+ kubectl logs pod/fio -n bench
Defaulted container "fio" out of: fio, init-container-resources (init)
INFO:    Converting SIF file to temporary sandbox...
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-write: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;80078;312;104755;0;0;0.000000;0.000000;73;135578;3191.180090;8618.044204;1.000000%=95;5.000000%=95;10.000000%=96;20.000000%=97;30.000000%=98;40.000000%=100;50.000000%=107;60.000000%=120;70.000000%=166;80.000000%=6717;90.000000%=10813;95.000000%=15663;99.000000%=47972;99.500000%=57933;99.900000%=95944;99.950000%=111673;99.990000%=127401;0%=0;0%=0;0%=0;78;135581;3195.785883;8618.084276;4096;1179136;100.000000%;80124.325359;112135.869000;0.185196%;3.897703%;7427;0;10;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;36.79%;42.79%;0.07%;0.01%;0.00%;0.00%;0.00%;9.18%;8.47%;1.76%;0.86%;0.08%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;570;21801;0;0;31668;312331;343999;84.45%;slaves;8297;32193;333;3447;590770;342574;957307;94.77%;sda;8297;32193;333;3447;590770;342574;957307;94.77%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=359: Sat Nov 25 18:02:25 2023
  write: IOPS=312, BW=78.2MiB/s (82.0MB/s)(8192MiB/104755msec); 0 zone resets
    clat (usec): min=73, max=135578, avg=3191.18, stdev=8618.04
     lat (usec): min=78, max=135581, avg=3195.79, stdev=8618.08
    clat percentiles (usec):
     |  1.00th=[    96],  5.00th=[    96], 10.00th=[    97], 20.00th=[    98],
     | 30.00th=[    99], 40.00th=[   101], 50.00th=[   108], 60.00th=[   121],
     | 70.00th=[   167], 80.00th=[  6718], 90.00th=[ 10814], 95.00th=[ 15664],
     | 99.00th=[ 47973], 99.50th=[ 57934], 99.90th=[ 95945], 99.95th=[111674],
     | 99.99th=[127402]
   bw (  KiB/s): min= 4096, max=1179136, per=100.00%, avg=80124.33, stdev=112135.87, samples=209
   iops        : min=   16, max= 4606, avg=312.99, stdev=438.03, samples=209
  lat (usec)   : 100=36.79%, 250=42.79%, 500=0.07%, 750=0.01%
  lat (msec)   : 10=9.18%, 20=8.47%, 50=1.76%, 100=0.86%, 250=0.08%
  cpu          : usr=0.19%, sys=3.90%, ctx=7427, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=78.2MiB/s (82.0MB/s), 78.2MiB/s-78.2MiB/s (82.0MB/s-82.0MB/s), io=8192MiB (8590MB), run=104755-104755msec

Disk stats (read/write):
    dm-2: ios=570/21801, merge=0/0, ticks=31668/312331, in_queue=343999, util=84.45%, aggrios=8297/32193, aggrmerge=333/3447, aggrticks=590770/342574, aggrin_queue=957307, aggrutil=94.77%
  sda: ios=8297/32193, merge=333/3447, ticks=590770/342574, in_queue=957307, util=94.77%
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-read: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-read;0;0;8388608;265327;1036;31616;0;0;0.000000;0.000000;560;71434;962.511684;1854.812679;1.000000%=757;5.000000%=782;10.000000%=798;20.000000%=815;30.000000%=831;40.000000%=839;50.000000%=847;60.000000%=856;70.000000%=864;80.000000%=897;90.000000%=962;95.000000%=995;99.000000%=1105;99.500000%=1679;99.900000%=35913;99.950000%=41156;99.990000%=45875;0%=0;0%=0;0%=0;560;71435;962.726884;1854.813025;120832;301056;99.997984%;265321.650794;43325.565142;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.445991%;13.117191%;32786;1;72;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.60%;94.67%;4.24%;0.09%;0.09%;0.05%;0.23%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;33147;11;0;0;30345;109;30454;99.60%;slaves;35982;413;1172;1;54554;3199;60283;99.31%;sda;35982;413;1172;1;54554;3199;60283;99.31%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=401: Sat Nov 25 18:05:20 2023
  read: IOPS=1036, BW=259MiB/s (272MB/s)(8192MiB/31616msec)
    clat (usec): min=560, max=71434, avg=962.51, stdev=1854.81
     lat (usec): min=560, max=71435, avg=962.73, stdev=1854.81
    clat percentiles (usec):
     |  1.00th=[  758],  5.00th=[  783], 10.00th=[  799], 20.00th=[  816],
     | 30.00th=[  832], 40.00th=[  840], 50.00th=[  848], 60.00th=[  857],
     | 70.00th=[  865], 80.00th=[  898], 90.00th=[  963], 95.00th=[  996],
     | 99.00th=[ 1106], 99.50th=[ 1680], 99.90th=[35914], 99.95th=[41157],
     | 99.99th=[45876]
   bw (  KiB/s): min=120832, max=301056, per=100.00%, avg=265321.65, stdev=43325.57, samples=63
   iops        : min=  472, max= 1176, avg=1036.41, stdev=169.24, samples=63
  lat (usec)   : 750=0.60%, 1000=94.67%
  lat (msec)   : 2=4.24%, 4=0.09%, 10=0.09%, 20=0.05%, 50=0.23%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.45%, sys=13.12%, ctx=32786, majf=1, minf=72
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=259MiB/s (272MB/s), 259MiB/s-259MiB/s (272MB/s-272MB/s), io=8192MiB (8590MB), run=31616-31616msec

Disk stats (read/write):
    dm-2: ios=33147/11, merge=0/0, ticks=30345/109, in_queue=30454, util=99.60%, aggrios=35982/413, aggrmerge=1172/1, aggrticks=54554/3199, aggrin_queue=60283, aggrutil=99.31%
  sda: ios=35982/413, merge=1172/1, ticks=54554/3199, in_queue=60283, util=99.31%
INFO:    Cleaning up image...
+ kubectl delete namespace bench
namespace "bench" deleted