logs/fio-diskrnd/hpk/000/log008.txt
+ kubectl create namespace bench
namespace/bench created
+ kubectl create -n bench -f -
persistentvolumeclaim/claim1 created
+ kubectl create -n bench -f -
pod/fio created
+ kubectl wait -n bench --for condition=Ready --timeout=10m pod/fio
pod/fio condition met
+ kubectl wait -n bench --for condition=Ready=False --timeout=10h pod/fio
pod/fio condition met
+ kubectl logs pod/fio -n bench
Defaulted container "fio" out of: fio, init-container-resources (init)
INFO:    Converting SIF file to temporary sandbox...
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-write: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;82071;320;102211;0;0;0.000000;0.000000;73;207700;3113.352200;8230.729900;1.000000%=95;5.000000%=96;10.000000%=96;20.000000%=97;30.000000%=99;40.000000%=102;50.000000%=110;60.000000%=140;70.000000%=177;80.000000%=7045;90.000000%=10813;95.000000%=14876;99.000000%=31326;99.500000%=55836;99.900000%=87556;99.950000%=119013;99.990000%=160432;0%=0;0%=0;0%=0;77;207704;3118.150453;8230.705082;2560;1154560;100.000000%;82191.058824;107221.602795;0.156540%;4.156149%;7021;0;9;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;32.73%;46.07%;0.14%;0.00%;0.00%;0.00%;0.00%;8.24%;10.75%;1.41%;0.56%;0.09%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;536;21448;0;0;41062;290127;331189;84.07%;slaves;11978;31787;1568;3341;849491;306476;1176341;94.31%;sda;11978;31787;1568;3341;849491;306476;1176341;94.31%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=361: Sat Nov 25 18:07:37 2023
  write: IOPS=320, BW=80.1MiB/s (84.0MB/s)(8192MiB/102211msec); 0 zone resets
    clat (usec): min=73, max=207700, avg=3113.35, stdev=8230.73
     lat (usec): min=77, max=207704, avg=3118.15, stdev=8230.71
    clat percentiles (usec):
     |  1.00th=[    96],  5.00th=[    97], 10.00th=[    97], 20.00th=[    98],
     | 30.00th=[   100], 40.00th=[   103], 50.00th=[   111], 60.00th=[   141],
     | 70.00th=[   178], 80.00th=[  7046], 90.00th=[ 10814], 95.00th=[ 14877],
     | 99.00th=[ 31327], 99.50th=[ 55837], 99.90th=[ 87557], 99.95th=[119014],
     | 99.99th=[160433]
   bw (  KiB/s): min= 2560, max=1154560, per=100.00%, avg=82191.06, stdev=107221.60, samples=204
   iops        : min=   10, max= 4510, avg=321.06, stdev=418.83, samples=204
  lat (usec)   : 100=32.73%, 250=46.07%, 500=0.14%
  lat (msec)   : 10=8.24%, 20=10.75%, 50=1.41%, 100=0.56%, 250=0.09%
  cpu          : usr=0.16%, sys=4.16%, ctx=7021, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=80.1MiB/s (84.0MB/s), 80.1MiB/s-80.1MiB/s (84.0MB/s-84.0MB/s), io=8192MiB (8590MB), run=102211-102211msec

Disk stats (read/write):
    dm-2: ios=536/21448, merge=0/0, ticks=41062/290127, in_queue=331189, util=84.07%, aggrios=11978/31787, aggrmerge=1568/3341, aggrticks=849491/306476, aggrin_queue=1176341, aggrutil=94.31%
  sda: ios=11978/31787, merge=1568/3341, ticks=849491/306476, in_queue=1176341, util=94.31%
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-read: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-read;0;0;8388608;284716;1112;29463;0;0;0.000000;0.000000;581;24722;896.895459;588.529267;1.000000%=765;5.000000%=790;10.000000%=798;20.000000%=815;30.000000%=831;40.000000%=839;50.000000%=847;60.000000%=856;70.000000%=872;80.000000%=929;90.000000%=970;95.000000%=995;99.000000%=1089;99.500000%=1449;99.900000%=11468;99.950000%=13565;99.990000%=22675;0%=0;0%=0;0%=0;581;24722;897.107638;588.528367;91648;299008;99.984546%;284672.000000;29513.155180;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.431064%;14.645985%;32777;0;72;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.43%;95.06%;4.10%;0.10%;0.17%;0.12%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;32781;12;0;0;26162;11;26173;99.72%;slaves;37419;277;2;5;52654;388;53141;99.70%;sda;37419;277;2;5;52654;388;53141;99.70%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=403: Sat Nov 25 18:10:32 2023
  read: IOPS=1112, BW=278MiB/s (292MB/s)(8192MiB/29463msec)
    clat (usec): min=581, max=24722, avg=896.90, stdev=588.53
     lat (usec): min=581, max=24722, avg=897.11, stdev=588.53
    clat percentiles (usec):
     |  1.00th=[  766],  5.00th=[  791], 10.00th=[  799], 20.00th=[  816],
     | 30.00th=[  832], 40.00th=[  840], 50.00th=[  848], 60.00th=[  857],
     | 70.00th=[  873], 80.00th=[  930], 90.00th=[  971], 95.00th=[  996],
     | 99.00th=[ 1090], 99.50th=[ 1450], 99.90th=[11469], 99.95th=[13566],
     | 99.99th=[22676]
   bw (  KiB/s): min=91648, max=299008, per=99.98%, avg=284672.00, stdev=29513.16, samples=58
   iops        : min=  358, max= 1168, avg=1112.00, stdev=115.29, samples=58
  lat (usec)   : 750=0.43%, 1000=95.06%
  lat (msec)   : 2=4.10%, 4=0.10%, 10=0.17%, 20=0.12%, 50=0.02%
  cpu          : usr=0.43%, sys=14.65%, ctx=32777, majf=0, minf=72
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=278MiB/s (292MB/s), 278MiB/s-278MiB/s (292MB/s-292MB/s), io=8192MiB (8590MB), run=29463-29463msec

Disk stats (read/write):
    dm-2: ios=32781/12, merge=0/0, ticks=26162/11, in_queue=26173, util=99.72%, aggrios=37419/277, aggrmerge=2/5, aggrticks=52654/388, aggrin_queue=53141, aggrutil=99.70%
  sda: ios=37419/277, merge=2/5, ticks=52654/388, in_queue=53141, util=99.70%
INFO:    Cleaning up image...
+ kubectl delete namespace bench
namespace "bench" deleted